import DataTable from "../components/DataTable";
function StudentsPage() {
  const studentsRows = [
    {
      "מקצוע": "סטודנט מנהלה תואר ראשון",
      'מס מקצוע': "10159",
      "שכר שעתי": 33.1,
      'בסוף שבוע / לילה מ״ס וסייר 150%': 49.65,
      'סופ״ש מ״ס וסייר': "",
    },
    {
      "מקצוע": "סטודנט מנהלה תואר שני",
      'מס מקצוע': "10159",
      "שכר שעתי": 38.1,
      'בסוף שבוע / לילה מ״ס וסייר 150%': 57.15,
      'סופ״ש מ״ס וסייר': "",
    },
    {
      "מקצוע": "סטודנט משל״ט",
      'מס מקצוע': "10156",
      "שכר שעתי": 39.73,
      'בסוף שבוע / לילה מ״ס וסייר 150%': 59.59,
      'סופ״ש מ״ס וסייר': "",
    },
    {
      "מקצוע": "סטודנט סיור/יס״מ",
      'מס מקצוע': "10158",
      "שכר שעתי": 41.4,
      'בסוף שבוע / לילה מ״ס וסייר 150%': 62.1,
      'סופ״ש מ״ס וסייר': 72.45,
    },
    {
      "מקצוע": "סטודנט מג״ב",
      'מס מקצוע': "10176",
      "שכר שעתי": 45.31,
      'בסוף שבוע / לילה מ״ס וסייר 150%': 67.96,
      'סופ״ש מ״ס וסייר': 79.29,
    },
    {
      "מקצוע": "סטודנט סיגינט",
      'מס מקצוע': "20265",
      "שכר שעתי": 50.57,
      'בסוף שבוע / לילה מ״ס וסייר 150%': 75.85,
      'סופ״ש מ״ס וסייר': "",
    },
    {
      "מקצוע": "סטודנט סיגינט",
      'מס מקצוע': "20264",
      "שכר שעתי": 60,
      'בסוף שבוע / לילה מ״ס וסייר 150%': 90,
      'סופ״ש מ״ס וסייר': "",
    },
  ];

  return (
    <div className="page-wrapper">
      <section className="intro-page">
        <header className="intro-main-header">
          <h1>סטודנטים</h1>

          <p className="intro-subtitle">
            טבלת שכר שעתי לסטודנטים ודגשים לתוספות לפי סוג השירות
          </p>
        </header>

        <div className="intro-body">
          <DataTable 
            rows={studentsRows} 
            showToolbar={false} 
            showColumnFilters={false} 
          />

          <p className="students-emphasis">
            על כל שעת עבודה יזוכה הסטודנט ב־1.51 ₪ דמי הבראה.
          </p>

          <div className="students-notes">
            <h3>סטודנט מנהלה</h3>

            <p>תוספת ותק בשירות:</p>

            <ul>
              <li>עד 12 חודשים תוספת של 0.8 אג׳ לערך שעת עבודה.</li>
              <li>מחודש 13 עד חודש 24 תוספת של 1.3 ₪ לערך שעת עבודה.</li>
              <li>מחודש 25 ואילך, תוספת של 1.8 ₪ לערך שעת עבודה.</li>
            </ul>

            <p>
              תוספת שירות חובה, צה״ל / משטרה חובה / שירות לאומי:
            </p>

            <ul>
              <li>0.2 אג׳ תוספת לערך שעת עבודה לכל שנת שירות.</li>
            </ul>
          </div>
        </div>
      </section>
    </div>
  );
}

export default StudentsPage;